tutorial_blog/app/controllers/articles_controller.rb

  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-23 03:55:08.992414"], ["text", "Donuts."], ["title", "Food for thought"], ["updated_at", "2015-11-23 03:55:08.992414"]]